first_routes_and_controllers/app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "'chewbacca@hotmail.com'"], ["updated_at", "2022-03-09 19:17:11.098453"], ["id", 3]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "'chewbacca'"], ["email", "'chewbacca@hotfail.com'"], ["created_at", "2022-03-09 19:12:35.878537"], ["updated_at", "2022-03-09 19:12:35.878537"]]

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]