art_share_api/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 11]]
---
  def index
    @artworks = User.find(params[:artist_id]).all_artworks