art_share_api/app/controllers/artwork_shares_controller.rb

  def index
    @artworks = User.find(params[:user_id]).all_artworks
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def create
    @artwork_share = ArtworkShare.new(artwork_shares_params)
    if @artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 8], ["viewer_id", 11], ["created_at", "2022-03-09 21:30:19.262771"], ["updated_at", "2022-03-09 21:30:19.262771"]]

  def destroy
    @artwork_share = ArtworkShare.find(params[:id])
    @artwork_share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 8]]