art_share_api/app/controllers/artworks_controller.rb

  def index
    @artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks"