art_share_api/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def index
    @artworks = User.find(params[:user_id]).all_artworks

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "6AM"], ["updated_at", "2022-03-09 20:43:17.408968"], ["id", 7]]
---
  def update
    @artwork = Artwork.find(params[:id])
    if @artwork.update(artwork_params)

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @artwork = Artwork.new(artwork_params)
    if @artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    @artwork = Artwork.find(params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 10]]
---
  def destroy
    @artwork = Artwork.find(params[:id])
    @artwork.destroy

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 64], ["LIMIT", 1]]
SELECT "collections".* FROM "collections" WHERE "collections"."artwork_id" = $1  [["artwork_id", 64]]
---
  def collections
    render json: Artwork.find(params[:id]).collections