art_share_api/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 13]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
  def index
    if params[:artwork_id]
      @comments = Artwork.find(params[:artwork_id]).comments
    else # we know we are dealing with user_id
      @comments = User.find(params[:user_id]).comments