art_share_api/app/controllers/likes_controller.rb

  def index

    if params[:like_type] == 'Comment'
      render json: User.find(params[:user_id]).liked_comments
    elsif params[:like_type] == 'Artwork'
      render json: User.find(params[:user_id]).liked_artworks
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]