art_share_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if params[:username]
      render json: User.search(params[:username])
    else
      @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "'chewbacca@hotmail.com'"], ["updated_at", "2022-03-09 19:17:11.098453"], ["id", 3]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "'yoda'"], ["created_at", "2022-03-09 20:36:02.308963"], ["updated_at", "2022-03-09 20:36:02.308963"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 14]]
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
  def favorite_artworks
    render json: User.find(params[:id]).favorite_artworks

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
  def favorite_shared_artworks
    render json: User.find(params[:id]).favorite_shared_artworks

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
---
  def collections
    render json: User.find(params[:id]).collections

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
---
  def collection_names
    render json: User.find(params[:id]).collection_names

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
---
  def artworks_in_collection
    render json: User.find(params[:id]).artworks_in_collection(params[:collection_name])